app/controllers/judges_controller.rb

  def index
    @judges = Judge.all
---
SELECT * FROM "judges"

  def create
    @judge = Judge.new(params[:judge])
    if @judge.save
---
INSERT INTO "judges" ("name", "updated_at", "url", "created_at") VALUES('UVa Online Judge', '2008-11-30 03:24:58', 'http://icpcres.ecs.baylor.edu/onlinejudge/', '2008-11-30 03:24:58')

  def update
    if @judge.update_attributes(params[:judge])
---
UPDATE "judges" SET "url" = 'http://www.spoj.pl/', "updated_at" = '2008-11-30 04:10:48' WHERE "id" = 3

  def destroy
    @judge.destroy
---
DELETE FROM "judges" WHERE "id" = 4

  def find_judge
    @judge = Judge.find(params[:id])
---
SELECT * FROM "judges" WHERE ("judges"."id" = 4)