app/controllers/problems_controller.rb

SELECT * FROM "judges" WHERE ("judges"."id" = 7)
---
  def new
    @judge = Judge.find(params[:judge_id])

INSERT INTO "problems" ("updated_at", "title", "number", "url", "judge_id", "created_at") VALUES('2008-11-30 09:41:35', 'Race tracks', '298', 'http://icpcres.ecs.baylor.edu/onlinejudge/external/2/298.html', 7, '2008-11-30 09:41:35')
---
  def create
    @problem = Problem.new(params[:problem])
    if @problem.save

UPDATE "problems" SET "title" = 'Race trackssas', "updated_at" = '2008-11-30 17:53:51' WHERE "id" = 9
---
  def update
    if @problem.update_attributes(params[:problem])

DELETE FROM "problems" WHERE "id" = 1
---
  def destroy
    judge = @problem.judge
    @problem.destroy

SELECT * FROM "problems" WHERE ("problems".judge_id = 2)
---
  def find_problem
    @problem = Problem.find(params[:id])