app/controllers/solutions_controller.rb

INSERT INTO "solutions" ("updated_at", "explanation", "source_code_content_type", "source_code_file_name", "source_code_file_size", "problem_id", "user_id", "source_code_updated_at", "created_at") VALUES('2008-11-30 18:41:49', 'Muy buen problema.', NULL, NULL, NULL, 10, 3, NULL, '2008-11-30 18:41:49')
SELECT * FROM "problems" WHERE ("problems"."id" = 13)
---
  def create
    @solution = Solution.new(params[:solution])
    if @solution.save
      flash[:notice] = "Successfully created solution."

      deliver_email(@solution) do
        address_book = User.emails(:except => @solution.user)
        MailOffice.deliver_new_solution(address_book, @solution,
                                        problem_url(@solution.problem),
                                        root_url) unless address_book.empty?

UPDATE "solutions" SET "explanation" = 'adfadfsadf', "source_code_file_name" = 'test1.cpp', "source_code_updated_at" = '2008-12-01 00:46:01', "source_code_file_size" = 393, "updated_at" = '2008-12-01 00:46:01' WHERE "id" = 8
---
  def update
    if @solution.update_attributes(params[:solution])

DELETE FROM "solutions" WHERE "id" = 13
---
  def destroy
    problem = @solution.problem
    @solution.destroy

SELECT * FROM "solutions" WHERE ("solutions"."id" = 13)
---
  def find_solution
    @solution = Solution.find(params[:id])