app/controllers/users_controller.rb

  def update
    cookies.delete :auth_token
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "crypted_password" = '84f4fdc899ed7b8f73a3b05c7c50152d6f7886b2', "updated_at" = '2008-12-01 02:18:05' WHERE "id" = 1

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "name", "updated_at", "crypted_password", "remember_token_expires_at", "is_admin", "is_moderator", "remember_token", "login", "email", "created_at") VALUES('e0c583935b662ee858ed652a3200d2cc337acf22', 'Federico Mejía', '2008-12-03 03:52:56', '0a55ca328c73ab9cf6fbd31994e2282658733a1a', NULL, NULL, NULL, NULL, 'fedemp', 'fedemp@gmail.com', '2008-12-03 03:52:56')

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "id" = 1

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1